AWS_RedisCluster/6_redis/2Stress_cpu8.txt
====== PING_INLINE ======
  100000 requests completed in 3.52 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
92.68% <= 2 milliseconds
99.34% <= 3 milliseconds
99.56% <= 4 milliseconds
99.61% <= 5 milliseconds
99.72% <= 6 milliseconds
99.83% <= 7 milliseconds
99.86% <= 8 milliseconds
99.90% <= 9 milliseconds
99.93% <= 10 milliseconds
99.97% <= 11 milliseconds
100.00% <= 12 milliseconds
28441.41 requests per second

====== PING_BULK ======
  100000 requests completed in 3.52 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
93.11% <= 2 milliseconds
99.37% <= 3 milliseconds
99.68% <= 4 milliseconds
99.75% <= 5 milliseconds
99.80% <= 6 milliseconds
99.80% <= 7 milliseconds
99.81% <= 8 milliseconds
99.86% <= 9 milliseconds
99.91% <= 10 milliseconds
99.95% <= 11 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 210 milliseconds
28449.50 requests per second

====== SET ======
  100000 requests completed in 3.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
94.56% <= 2 milliseconds
98.15% <= 3 milliseconds
98.64% <= 4 milliseconds
99.51% <= 5 milliseconds
99.63% <= 6 milliseconds
99.72% <= 7 milliseconds
99.79% <= 8 milliseconds
99.81% <= 9 milliseconds
99.82% <= 10 milliseconds
99.85% <= 11 milliseconds
99.86% <= 12 milliseconds
99.90% <= 13 milliseconds
99.96% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 202 milliseconds
30721.96 requests per second

====== GET ======
  100000 requests completed in 3.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
93.04% <= 2 milliseconds
98.73% <= 3 milliseconds
99.08% <= 4 milliseconds
99.45% <= 5 milliseconds
99.75% <= 6 milliseconds
99.86% <= 7 milliseconds
99.88% <= 8 milliseconds
99.90% <= 9 milliseconds
99.94% <= 10 milliseconds
99.98% <= 11 milliseconds
100.00% <= 11 milliseconds
29291.15 requests per second

====== INCR ======
  100000 requests completed in 3.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
94.13% <= 2 milliseconds
99.04% <= 3 milliseconds
99.36% <= 4 milliseconds
99.65% <= 5 milliseconds
99.80% <= 6 milliseconds
99.90% <= 7 milliseconds
99.95% <= 8 milliseconds
99.95% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 12 milliseconds
30021.01 requests per second

====== LPUSH ======
  100000 requests completed in 3.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.11% <= 1 milliseconds
94.27% <= 2 milliseconds
98.79% <= 3 milliseconds
99.38% <= 4 milliseconds
99.85% <= 5 milliseconds
99.90% <= 11 milliseconds
99.90% <= 13 milliseconds
99.92% <= 14 milliseconds
99.96% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 16 milliseconds
31162.36 requests per second

====== RPUSH ======
  100000 requests completed in 3.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
80.68% <= 2 milliseconds
97.68% <= 3 milliseconds
98.66% <= 4 milliseconds
99.25% <= 5 milliseconds
99.75% <= 6 milliseconds
99.80% <= 7 milliseconds
99.82% <= 8 milliseconds
99.85% <= 9 milliseconds
99.85% <= 10 milliseconds
99.85% <= 11 milliseconds
99.86% <= 12 milliseconds
99.89% <= 13 milliseconds
99.91% <= 14 milliseconds
99.93% <= 15 milliseconds
99.97% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 17 milliseconds
27510.32 requests per second

====== LPOP ======
  100000 requests completed in 3.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
83.04% <= 2 milliseconds
98.39% <= 3 milliseconds
99.03% <= 4 milliseconds
99.56% <= 5 milliseconds
99.68% <= 6 milliseconds
99.77% <= 7 milliseconds
99.81% <= 8 milliseconds
99.84% <= 9 milliseconds
99.87% <= 10 milliseconds
99.90% <= 11 milliseconds
99.92% <= 12 milliseconds
99.97% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
28208.74 requests per second

====== RPOP ======
  100000 requests completed in 3.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.22% <= 1 milliseconds
89.49% <= 2 milliseconds
99.00% <= 3 milliseconds
99.41% <= 4 milliseconds
99.73% <= 5 milliseconds
99.86% <= 6 milliseconds
99.90% <= 7 milliseconds
99.90% <= 8 milliseconds
99.92% <= 9 milliseconds
99.94% <= 10 milliseconds
99.98% <= 11 milliseconds
100.00% <= 11 milliseconds
30021.01 requests per second

====== SADD ======
  100000 requests completed in 3.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.01% <= 1 milliseconds
89.26% <= 2 milliseconds
96.38% <= 3 milliseconds
98.40% <= 4 milliseconds
99.64% <= 5 milliseconds
99.80% <= 6 milliseconds
99.86% <= 7 milliseconds
99.90% <= 8 milliseconds
99.93% <= 9 milliseconds
99.95% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 12 milliseconds
30750.31 requests per second

====== HSET ======
  100000 requests completed in 3.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.16% <= 1 milliseconds
92.12% <= 2 milliseconds
99.06% <= 3 milliseconds
99.63% <= 4 milliseconds
99.89% <= 5 milliseconds
99.94% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 7 milliseconds
29700.03 requests per second

====== SPOP ======
  100000 requests completed in 3.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.48% <= 1 milliseconds
96.47% <= 2 milliseconds
99.50% <= 3 milliseconds
99.82% <= 4 milliseconds
99.91% <= 5 milliseconds
100.00% <= 5 milliseconds
32499.19 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

1.35% <= 1 milliseconds
97.85% <= 2 milliseconds
99.88% <= 3 milliseconds
99.94% <= 4 milliseconds
99.95% <= 5 milliseconds
100.00% <= 5 milliseconds
35348.18 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.17% <= 1 milliseconds
95.83% <= 2 milliseconds
99.85% <= 3 milliseconds
99.95% <= 12 milliseconds
99.98% <= 13 milliseconds
100.00% <= 13 milliseconds
32247.66 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.42 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.33% <= 1 milliseconds
87.62% <= 2 milliseconds
98.31% <= 3 milliseconds
98.83% <= 4 milliseconds
99.18% <= 5 milliseconds
99.47% <= 6 milliseconds
99.57% <= 7 milliseconds
99.65% <= 8 milliseconds
99.71% <= 9 milliseconds
99.80% <= 10 milliseconds
99.85% <= 11 milliseconds
99.88% <= 12 milliseconds
99.90% <= 13 milliseconds
99.93% <= 14 milliseconds
99.95% <= 16 milliseconds
99.95% <= 17 milliseconds
99.99% <= 18 milliseconds
100.00% <= 203 milliseconds
29222.68 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 3.56 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
86.63% <= 2 milliseconds
99.32% <= 3 milliseconds
99.58% <= 4 milliseconds
99.61% <= 5 milliseconds
99.64% <= 6 milliseconds
99.71% <= 7 milliseconds
99.80% <= 8 milliseconds
99.90% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
28074.12 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 3.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
95.51% <= 2 milliseconds
99.26% <= 3 milliseconds
99.87% <= 4 milliseconds
99.92% <= 5 milliseconds
99.96% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 203 milliseconds
29985.01 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 3.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
86.59% <= 2 milliseconds
99.18% <= 3 milliseconds
99.88% <= 4 milliseconds
99.91% <= 5 milliseconds
99.94% <= 6 milliseconds
99.97% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
29647.20 requests per second